rules = [
    ('E', 1),  # E -> T
    ('T', 3),  # T -> T * F
    ('T', 1),  # T -> F
    ('F', 3),  # F -> ( T )
    ('F', 1)   # F -> id
]

# 파서 테이블 (예제에서는 고정된 테이블 사용)
parse_table = [
    { '(': 's3', 'id': 's4', 'T': 1, 'F': 2},
    {'*': 's5', '$': 'acc'},
    {'*': 'r2', ')': 'r2', '$': 'r2'},  # Changed r2 to r4
    {'(': 's3','id': 's4', 'T': 6, 'F': 2},  # Changed T to 7
    {'*': 'r4', ')': 'r4', '$':'r4'},
    {'(': 's3', 'id': 's4', 'F':7},  # Changed r6 to r5 and removed '+'
    {'*': 's5', ')': 's8'},
    {'*': 'r1', ')': 'r1', '$': 'r1'},
    {'*': 'r3', ')': 'r3', '$': 'r3'},
]